InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Размер</Name>
					<Comment>[A2105505-324] Разработка по ФДР С51.002 Доработка справочника Номенклатура и сопутствующих ему объектов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_Размеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_КодТНВЭД</Name>
					<Comment>[A2105505-324] Разработка по ФДР С51.002 Доработка справочника Номенклатура и сопутствующих ему объектов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Штрихкод</Name>
					<Comment>JIRA№ A2105505-1802</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	  
	// << 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
	КР_ПередЗаписьюШтрихкодовНоменклатуры(Отказ, Замещение);
	// >> 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324      

	// << 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802     
	ДополнительныеСвойства.Вставить("КР_МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	Если Не ДополнительныеСвойства.Свойство(КР_УТ11_ЦБ_Магазин_ЗагрузкаДанныхСервер.СвойствоОбъектБылЗагружен()) 
		Тогда 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Штрихкод КАК Штрихкод,         
		|	Т.Характеристика КАК Характеристика         
		|ПОМЕСТИТЬ ХарактеристикиКОчисткеШтрихкода
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Т
		|ГДЕ
		|	(Т.Штрихкод = &Штрихкод 
		|		ИЛИ &ШтрихкодПустой)
		|	И Т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|	И Т.Номенклатура.ИспользованиеХарактеристик 
		|		= ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|	И Т.Характеристика.Владелец ССЫЛКА Справочник.Номенклатура
		|	И Т.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)"
		);   
		
		Штрихкод = Отбор.Штрихкод.Значение;
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		Запрос.УстановитьПараметр("ШтрихкодПустой", Не ЗначениеЗаполнено(Штрихкод));   
	    Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.КР_МенеджерВременныхТаблиц;

		Запрос.Выполнить();   
		
	КонецЕсли;	
	// >> 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("Характеристика");
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ СтрокиСОшибками
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			ИЛИ ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			ИЛИ ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеЗаполненаХарактеристика
	|ИЗ
	|	СтрокиСОшибками КАК СтрокиСОшибками
	|ГДЕ
	|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)";

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТаблицаТоваров",  ЭтотОбъект.Выгрузить(,"НомерСтроки,Номенклатура,Характеристика"));
	
	ШаблонСообщения = НСтр("ru='Поле ""%Характеристика%"" не заполнено'");
	ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Характеристика%", НСтр("ru = 'Характеристика'"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НеЗаполненаХарактеристика Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Характеристика","Запись",Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// << 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802
Процедура ПриЗаписи(Отказ, Замещение)

	Если Не ДополнительныеСвойства.Свойство(КР_УТ11_ЦБ_Магазин_ЗагрузкаДанныхСервер.СвойствоОбъектБылЗагружен()) 
		Тогда 

		// Сравниваем то что было с тем что стало по характеристикам.
		// Заполняем/очищаем штрихкоды
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Штрихкод КАК Штрихкод,
		|	Т.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ХарактеристикиКЗаполнениюШтрихкода
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Т
		|ГДЕ
		|	(Т.Штрихкод = &Штрихкод
		|			ИЛИ &ШтрихкодПустой)
		|	И Т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|	И Т.Номенклатура.ИспользованиеХарактеристик 
		|		= ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|	И Т.Характеристика.Владелец ССЫЛКА Справочник.Номенклатура
		|	И Т.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Стало.Штрихкод, """") КАК Штрихкод,
		|	ЕСТЬNULL(Стало.Характеристика, Было.Характеристика) КАК Характеристика
		|ИЗ
		|	ХарактеристикиКЗаполнениюШтрихкода КАК Стало
		|		ПОЛНОЕ СОЕДИНЕНИЕ ХарактеристикиКОчисткеШтрихкода КАК Было
		|		ПО Стало.Штрихкод = Было.Штрихкод
		|ГДЕ
		|	ВЫРАЗИТЬ(ЕСТЬNULL(Стало.Характеристика, Было.Характеристика) КАК Справочник.ХарактеристикиНоменклатуры).КР_Штрихкод 
		|		<> ЕСТЬNULL(Стало.Штрихкод, """")"
		);   
		
		Штрихкод = Отбор.Штрихкод.Значение;
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		Запрос.УстановитьПараметр("ШтрихкодПустой", Не ЗначениеЗаполнено(Штрихкод));   
	    Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.КР_МенеджерВременныхТаблиц;
		
		РезультатЗапроса = Запрос.Выполнить(); 
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			КР_ЗаписатьШтрихкод(ВыборкаДетальныеЗаписи.Характеристика, ВыборкаДетальныеЗаписи.Штрихкод, Отказ); 
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры // >> 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802

#КонецОбласти

#Область КР_ДобавленныеПроцедурыИФункции

// << 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
Процедура КР_ПередЗаписьюШтрихкодовНоменклатуры(Отказ, Замещение)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаШтрихкоды", ЭтотОбъект.Выгрузить(, "Номенклатура, Характеристика"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаШтрихкоды.Номенклатура КАК Номенклатура,
	|	ТаблицаШтрихкоды.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ врт_ТаблицаШтрихкоды
	|ИЗ
	|	&ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	врт_ТаблицаШтрихкоды.Номенклатура КАК Номенклатура,
	|	врт_ТаблицаШтрихкоды.Характеристика КАК Характеристика
	|ИЗ
	|	врт_ТаблицаШтрихкоды КАК врт_ТаблицаШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО врт_ТаблицаШтрихкоды.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И врт_ТаблицаШтрихкоды.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|ГДЕ
	|	НЕ ШтрихкодыНоменклатуры.Штрихкод ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ШаблонСообщения = НСтр("ru='%1 (%2). Для данной номенклатуры штрихкод существует.'");
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ШаблонСообщения, Выборка.Номенклатура, Выборка.Характеристика), , , , Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // >> 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324

// << 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802
Процедура КР_ЗаписатьШтрихкод(Характеристика, Штрихкод, Отказ)
	
	СправочникОбъект = Характеристика.ПолучитьОбъект();
	СправочникОбъект.КР_Штрихкод = Штрихкод;
	СправочникОбъект.ОбменДанными.Загрузка = Истина;   
	
	// Копируем дополнительные свойства набора запсей чтоб исключить ошибки..
	Для Каждого КлючЗначение Из ДополнительныеСвойства Цикл 
		СправочникОбъект.ДополнительныеСвойства.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	                                      
	
	СправочникОбъект.ДополнительныеСвойства.Вставить("КР_РазрешитьУстановкуШтрихкода", Истина);
	
	СправочникОбъект.Записать();

КонецПроцедуры // >> 09.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1802

#КонецОбласти

#КонецЕсли
